app/controllers/songs_controller.rb

SELECT "songs".* FROM "songs"
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
---
  def index
    @songs = Song.all
    if params[:artist_id]
      @artist = Artist.find_by(id: params[:artist_id])